Tekla Open API Reference for Tekla Structures 2025
ModelObjectVisualization.SetTemporaryState Method
Overload List
Name | Description
SetTemporaryState(List<Identifier>, Color)
 Sets visualization temporary state (red, blue, green and transparency) for given model object identifiers
SetTemporaryState(List<ModelObject>, Color)
 Sets visualization temporary state (red, blue, green and transparency) for given model objects
Top
See Also
Reference
ModelObjectVisualization Class
Tekla.Structures.Model.UI Namespace